w7d5/reddit_clone/app/models/user.rb

    def reset_session_token!
        self.session_token = generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-11-18 19:58:36.815114"], ["id", 1]]