w7d5/reddit_clone/app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def create
        if logged_in?
            @post = Post.new(post_params)
            @post.author_id = current_user.id
            @user = User.find_by(id: current_user.id)